#!/usr/bin/env bash
#
# cotarBitcoin.sh - Verifica a última cotação do Bitcoin
#
# Site:       https://4fasters.com.br
# Autor:      Mateus Müller
# Manutenção: Mateus Müller
#
#
#  Exemplos:
#      $ ./programa.sh
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 27/11/2021, Jesher:
#       - Início do programa
# ------------------------------------------------------------------------ #
# Testado em:
#   versão 5.0.17
# ------------------------------------------------------------------------ #

# ------------------------------- VARIÁVEIS ------------------------------ #

comeca=0
ate=100

# ------------------------------- TESTES --------------------------------- #

[ $comeca -ge $ate ] && exit 1

# ------------------------------------------------------------------------ #

# ------------------------------- EXECUÇÃO ------------------------------- #

for i in $(seq $comeca $ate)

do

for j in $(seq $i $ate)

do

printf "*"

done

printf "\n"

done
# ------------------------------------------------------------------------ #

